Repository: ArchontPnz/Printserver
Catalog: Printrun/locale/*/LC_MESSAGES/pronterface.po
Languages: ru

source: {0:d} layers,
ru: {0:d} слоев,

source: off
ru: откл

source: Communications Speed (default: 115200)
ru: Скорость соединения (по умолчанию 115200)

source: Heated Build Platform temp for ABS (default: 110 deg C)
ru: Температура стола для ABS (по умолчанию 100 градусов Цельсия)

source: Heated Build Platform temp for PLA (default: 60 deg C)
ru: Температура стола для ABS (по умолчанию 60 градусов Цельсия)

source: Feedrate for Control Panel Moves in Extrusions (default: 300mm/min)
ru: Скорость подачи пластика в экструдер (по умолчанию 300 мм/мин)

source: Port used to communicate with printer
ru: Порт, использующийся для соединения с принтером

source: Slice command default: python skeinforge/skeinforge_application/skeinforge_utilities/skeinforge_craft.py $s)
ru: Команда для запуска слайсинга: по умолчанию: python skeinforge/skeinforge_application/skeinforge_utilities/skeinforge_craft.py $s

source: Slice settings command default: python skeinforge/skeinforge_application/skeinforge.py
ru: Команда для запуска настроек слайсинга: по умолчанию: python skeinforge/skeinforge_application/skeinforge.py

source: Extruder temp for ABS (default: 230 deg C)
ru: Температура экструдера для ABS (по умолчанию 230 градусов Цельсия)

source: Extruder temp for PLA (default: 185 deg C)
ru: Температура экструдера для PLA (по умолчанию 185 градусов Цельсия)

source: Feedrate for Control Panel Moves in X and Y (default: 3000mm/min)
ru: Скорость перемещения по осям X и Y (по умолчанию 3000 мм/мин)

source: Feedrate for Control Panel Moves in Z (default: 200mm/min)
ru: Скорость перемещения по оси Z (по умолчанию 200 мм/мин)

source: Executable to run when the print is finished
ru: Команда, исполняющаяся после завершения печати

source: Bed
ru: Стол

source: Ex0
ru: Экст.

source: Bed Target
ru: Стол (цель)

source: Ex0 Target
ru: Экст. (цель)

source: Set Maximum Speed for X & Y axes (mm/min)
ru: Установить максимальную скорость осей X и Y (мм/мин)

source: Set Maximum Speed for Z axis (mm/min)
ru: Установить максимальную скорость оси Z (мм/мин)

source: Switch Hotend Off
ru: Отключить нагрев сопла

source: Select Temperature for Hotend
ru: Выбрать температуру сопла

source: Switch Hotend On
ru: Начать нагрев сопла

source: Switch Heated Bed Off
ru: Отключить нагрев стола

source: Select Temperature for Heated Bed
ru: Выбрать температуру стола

source: Switch Heated Bed On
ru: Начать нагрев стола

source: Amount to Extrude or Retract (mm)
ru: Кол-во пластика для выдавливания или втягивания (мм)

source: Extrude / Retract speed (mm/min)
ru: Скорость выдавливания/втягивания (мм/мин)

source: Click to examine / edit layers of loaded file
ru: Нажмите, чтобы просмотреть/изменить слои загруженного файла

source: Send commands to printer (Type 'help' for simple help function)
ru: Послать команды принтеру (Введите 'help' для вывода списка основых функций)

source: Send Command to Printer
ru: Послать команду принтеру

source: Toggle full screen
ru: Перейти в полноэкранный режим

source: Communication Settings Click to rescan ports
ru: Настройки подключения Нажмите для повторного сканирования портов

source: Select Port Printer is connected to
ru: Выберите порт, к которому подключен принтер

source: Select Baud rate for printer communication
ru: Выберите скорость передачи данных соединения с принтером

source: Connect to the printer
ru: Подключение к принтеру

source: Reset the printer
ru: Сброс принтера

source: Load a 3D model file
ru: Загрузить файл 3D-модели

source: SD Card Printing
ru: Печать с SD-карты

source: Start Printing Loaded File
ru: Старт печати загруженного файла

source: Pause Current Print
ru: Приостановить текущую печать

source: Recover previous Print
ru: Восстановить предыдущую печать

source: Recover
ru: Восстановить

source: Find
ru: Найти

source: Save
ru: Сохранить

source: Cancel
ru: Отмена

source: Edit settings
ru: Изменить значения переменных

source: Defaults
ru: Значения по умолчанию

source: Custom button
ru: Пользовательская кнопка

source: Button title
ru: Название кнопки

source: Command
ru: Команда

source: Color
ru: Цвет

source: WX is not installed. This program requires WX to run.
ru: Библиотека WX не установлена. Для этой программы требуется запуск WX.

source: Dimensions of Build Platform & optional offset of origin & optional switch position Examples: XXXxYYY XXX,YYY,ZZZ XXXxYYYxZZZ+OffX+OffY+OffZ XXXxYYYxZZZ+OffX+OffY+OffZ+HomeX+HomeY+HomeZ
ru: Размеры платформы построения + опциональное смещение начала координат + опциональное положение концевого выключателя Примеры: XXXxYYY XXX,YYY,ZZZ XXXxYYYxZZZ+OffX+OffY+OffZ XXXxYYYxZZZ+OffX+OffY+OffZ+HomeX+HomeY+HomeZ

source: Last Set Temperature for the Heated Print Bed
ru: Последняя установленная температура для печатного стола

source: Folder of last opened file
ru: Папка последнего открытого файла

source: Last Temperature of the Hot End
ru: Последняя установленная температура для сопла

source: Width of Extrusion in Preview (default: 0.5)
ru: Ширина экструзии в предварительном просмотре (по умолчанию: 0.5)

source: Fine Grid Spacing (default: 10)
ru: Интервал тонкой сетки (по умолчанию: 10)

source: Coarse Grid Spacing (default: 50)
ru: Интервал грубой сетки (по умолчанию: 50)

source: Pronterface background color (default: #FFFFFF)
ru: Цвет фона интерфейса (по умолчанию: #FFFFFF)

source: Printer Interface
ru: Интерфейс 3D-принтера

source: Motors off
ru: Откл. моторы

source: Switch all motors off
ru: Отключить все моторы

source: Check current hotend temperature
ru: Проверить текущую температуру сопла

source: Check temp
ru: Провер. температуру

source: Advance extruder by set length
ru: Выдавить пластик на указанную длину

source: Extrude
ru: Выдавить

source: Reverse
ru: Втянуть

source: Reverse extruder by set length
ru: Втянуть пластик на указаную длину

source: # I moved all your custom buttons into .pronsolerc. # Please don't add them here any more. # Backup of your old buttons is in custombtn.old
ru: # Все ваши пользовательские кнопки были перенесены в файл pronsolerc. #Пожалуйста, не добавляйте их больше. # Сохранения старых кнопок находится в custombtn.old

source: Note!!! You have specified custom buttons in both custombtn.txt and .pronsolerc
ru: Обратите внимание !!! Вы указали пользовательские кнопки в custombtn.txt и . pronsolerc

source: Ignoring custombtn.txt. Remove all current buttons to revert to custombtn.txt
ru: Игнорирование custombtn.txt. Удалите все кнопки, чтобы вернуться к custombtn.txt

source: Failed to start web interface
ru: Не удалось запустить веб-интерфейс

source: CherryPy is not installed. Web Interface Disabled.
ru: CherryPy не установлен. Веб-интерфейс отключен.

source: Print
ru: Печать

source: Printer is now online.
ru: Принтер подключен.

source: Disconnect
ru: Отключить

source: Setting hotend temperature to %f degrees Celsius.
ru: Установить температуру сопла до %f градусов Цельсия.

source: Printer is not online.
ru: Принтер не подключен.

source: You cannot set negative temperatures. To turn the hotend off entirely, set its temperature to 0°C.
ru: Вы не можете установить отрицательную температуру. Чтобы отключить нагрев сопла, установите температуру 0°C.

source: You must enter a temperature. (%s)
ru: Вы должны ввести температуру. (%s)

source: Setting bed temperature to %f degrees Celsius.
ru: Установить температуру стола до %f градусов Цельсия.

source: You cannot set negative temperatures. To turn the bed off entirely, set its temperature to 0.
ru: Вы не можете установить отрицательную температуру. Чтобы отключить нагрев стола, установите температуру 0°C.

source: Do you want to erase the macro?
ru: Вы хотите удалить макрос?

source: Cancelled.
ru: Отменено

source: Opens file
ru: Открыть файл

source: &Open...
ru: &Открыть...

source: Edit open file
ru: Редактировать открытый файл

source: &Edit...
ru: &Редактор G-кода

source: Clear output console
ru: Очистить содержимое выходной консоли

source: Clear console
ru: Очистить консоль

source: Project slices
ru: Проектирование слоев

source: Projector
ru: Проектор

source: Closes the Window
ru: Закрыть окно

source: E&xit
ru: &Выход

source: &File
ru: &Файл

source: &Macros
ru: &Макрос

source: <&New...>
ru: <&Новый...>

source: Options dialog
ru: Окно опций

source: &Options
ru: &Опции

source: Adjust slicing settings
ru: Установить параметры слайсинга

source: Slicing Settings
ru: Настройки слайсинга

source: &Settings
ru: &Параметры

source: Enter macro name
ru: Введите имя макроса

source: Macro name:
ru: Имя макроса:

source: Ok
ru: ОК

source: Macro name may contain only ASCII alphanumeric symbols and underscores
ru: Имя макроса может содержать только буквенно-цифровые символы ASCII и символы подчеркивания

source: Name '%s' is being used by built-in command
ru: Имя '%s' используется внутренней командой

source: Port
ru: Порт

source: Connect
ru: Подключение

source: Reset
ru: Сброс

source: Debug G-code
ru: Отладка G-кода

source: Print all G-code sent to and received from the printer.
ru: Распечатать весь G-код, отправленный на принтер и полученный от него.

source: Load file
ru: Открыть

source: Compose
ru: Компоновка

source: &Display Calibration
ru: Калибровка дисплея

source: Calibrating the display sensor
ru: Калибровка сенсора дисплея

source: &Backup
ru: &Резервная копия

source: Create backup of calibration settings
ru: Создать резервную копию настроек калибровки

source: &Recovery
ru: Восстановление

source: Recover calibration settings
ru: Восстановить настройки калибровки

source: &Calibration
ru: &Калибровка

source: Calibration completed.
ru: Калибровка завершена.

source: Calibration failed. Possible reasons: - No package xinput-calibrator - No file with calibration settings Try 'Recovery'
ru: Ошибка калибровки. Возможные причины: - Не установлен пакет xinput-calibrator - Нет файла с настройками калибровки Попробуйте 'Восстановление'

source: The file with calibration settings copied to '/home/pi/calibration/'
ru: Файл с настройками калибровки скопирован в '/home/pi/calibration/'

source: Backup failed. No file with calibration settings. Try 'Recovery'
ru: Ошибка резервного копирования. Файл с настройками калибровки не найден. Попробуйте 'Восстановление'

source: Calibration settings recovered.
ru: Настройки калибровки восстановлены.

source: Recovery failed. No file '/home/pi/calibration/99-calibration.conf'
ru: Ошибка восстановления. Не найден файл '/home/pi/calibration/99-calibration.conf'

source: Pause
ru: Пауза

source: Send
ru: Ввод

source: mm/min Z:
ru: мм/мин Z:

source: Watch
ru: Смотреть

source: Heat:
ru: Сопло:

source: Off
ru: Откл

source: Set
ru: Старт

source: Bed:
ru: Стол:

source: mm
ru: мм

source: mm/ min
ru: мм/ мин

source: Not connected to printer.
ru: Принтер не подключен.

source: SD Upload
ru: Загрузка SD

source: SD Print
ru: Печать с SD

source: Mini mode
ru: Мини-режим

source: Full mode
ru: Полный режим

source: Execute command:
ru: Запустить команду:

source: click to add new custom button
ru: Добавить пользовательскую кнопку

source: Defines custom button. Usage: button <num> "title" [/c "colour"] command
ru: Определяет пользовательскую кнопку. Использование: кнопка <номер> "Название" [/c "цвет"] команда

source: Custom button number should be between 0 and 63
ru: Номера пользовательских кнопок должны быть между 0 и 63.

source: Edit custom button '%s'
ru: Отредактируйте пользовательскую кнопку '%s'

source: Move left <<
ru: Переместить вверх <<

source: Move right >>
ru: Переместить вниз >>

source: Remove custom button '%s'
ru: Удалить пользовательскую кнопку '%s'

source: Add custom button
ru: Добавить пользовательскую кнопку

source: event object missing
ru: событие с отсутствующим объектом

source: Invalid period given.
ru: Указан неверный период.

source: Monitoring printer.
ru: Мониторинг принтера.

source: Done monitoring.
ru: Завершение мониторинга.

source: SD printing:%04.2f %%
ru: Печать с SD: %04.2f %%

source: Printing: %04.2f%% |
ru: Печать: %04.2f%% |

source: Line# %d of %d lines |
ru: Линия# %d из %d линий |

source: Est: %s of %s осталось |
ru: Время: %s из %s |

source: Z: %0.2f mm
ru: Z: %0.2f мм

source: Opening file failed.
ru: Не удалось открыть файл

source: Starting print
ru: Начало печати...

source: Pick SD file
ru: Выберите файл на SD-карте

source: Select the file to print
ru: Выберите файл для печати:

source: Failed to execute slicing software:
ru: Произошла ошибка во время слайсинга:

source: Slicing...
ru: Слайсинг...

source: , %d lines
ru: , %d линий

source: Loaded
ru: Загружено

source: Load File
ru: Загрузить файл

source: Slicing
ru: Слайсинг

source: Open file to print
ru: Открыть файл для печати

source: OBJ, STL, and GCODE files (*.gcode;*.gco;*.g;*.stl;*.STL;*.obj;*.OBJ)|*.gcode;*.gco;*.g;*.stl;*.STL;*.obj;*.OBJ|All Files (*.*)|*.*
ru: Файлы OBJ, STL et GCODE (;*.gcode;*.gco;*.g;*.stl;*.STL;*.obj;*.OBJ;)|*.gcode;*.gco;*.g;*.stl;*.STL;*.obj;*.OBJ|Все файлы (*.*)|*.*

source: File not found!
ru: Файл не найден

source: Loaded %s, %d lines
ru: Загружено %s, %d линий

source: mm of filament used in this print
ru: мм нити потребуется для печати

source: the print goes from %f mm to %f mm in X and is %f mm wide
ru: Печать идет с %f мм до %f мм по оси X и составляет %f мм в ширину

source: the print goes from %f mm to %f mm in Y and is %f mm wide
ru: Печать идет с %f мм до %f мм по оси Y и составляет %f мм в длину

source: the print goes from %f mm to %f mm in Z and is %f mm high
ru: Печать идет с %f мм до %f мм по оси Z и составляет %f мм в высоту

source: Estimated duration (pessimistic):
ru: Предполагаемое время печати:

source: No file loaded. Please use load first.
ru: Файл не загружен. Загрузите сначала файл

source: Restart
ru: Рестарт

source: File upload complete
ru: Загрузка файла завершена

source: Pick SD filename
ru: Выберите имя файла SD-карте

source: Paused.
ru: На паузе.

source: Resume
ru: Продолжить

source: Connecting...
ru: Соединение...

source: Disconnected.
ru: Отключение.

source: Reset.
ru: Сброс.

source: Are you sure you want to reset the printer?
ru: Вы действительно хотите выполнить сброс принтера?

source: Reset?
ru: Сбросить?
